Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/compiled/ted2020v1/en-ne.tmx
Source language: en
Languages: ne

source: So I looked at them right away, and they said, "No problem. We probably hit some birds."
ne: मैले उत्तिनै खेर उनीहरूलाई हेरे । र उनीहरूले भने, “कुनै समस्या होइन । हामीले कुनै चरासँग ठक्कर खाएको हुनुपर्छ ।”

source: The pilot had already turned the plane around, and we weren't that far.
ne: चालकले जहाज घुमाइसकेका थिए, र हामी धेरै टाढा पनि थिएनौ ।

source: You could see Manhattan.
ne: म्यानहटन देख्न सकिन्थ्यो ।

source: Two minutes later, three things happened at the same time.
ne: दुई मिनेट पछि, तीन वटा कुराहरु एकैसाथ भए ।

source: The pilot lines up the plane with the Hudson River.
ne: विमान चालकले जहाजलाई हड्सन नदी तिर सोझ्याए ।

source: That's usually not the route.
ne: त्यो नियमित बाटो थिएन । (हाँसो)

source: (Laughter) He turns off the engines.
ne: उनले इन्जिनहरु बन्द गरे ।

source: Now, imagine being in a plane with no sound.
ne: अब कल्पना गर्नुहोस् कि तपाईं यस्तो जहाज भित्र हुनुहुन्छ जुन बाट आवाज आइ राखेको छैन।

source: And then he says three words.
ne: र उनले तीन वटा शब्द भन्छन – – मैले अहिलेसम्म सुनेका मध्य कठोर शब्दहरु

source: He says, "Brace for impact."
ne: र उनी भन्छन, “नराम्रो परिणामको लागि तयारी गर ।”

source: I didn't have to talk to the flight attendant anymore.
ne: मैले जहाज–परिचारिकाहरूसँग अब कुरा गरिराख्नु परेन ।

source: (Laughter) I could see in her eyes, it was terror.
ne: (हाँसो) मैले उनको आँखा पढ्न सक्थे । त्यो भयानक थियो । जीवनको समाप्ति ।

source: Now I want to share with you three things I learned about myself that day.
ne: अब मैले त्यो दिन सिकेका ३ वटा महत्वपूर्ण कुरा तपाईंहरूलाई सुनाउँदैछु ।

source: I learned that it all changes in an instant.
ne: मैले सिके कि सबैकुरा निमेषभरमा परिवर्तन हुन सक्छन् ।

source: We have this bucket list, we have these things we want to do in life, and I thought about all the people I wanted to reach out to that I didn't, all the fences I wanted to mend, all the experiences I wanted to have and I never did.
ne: हामीसँग एउटा लामो सुची छ, हामी यी कुराहरु आफ्नो जीवनकालमा गर्न चाहन्छौं, मैले जीवनमा भेट्न चाहेका तर नभेटेका मानिसलाई सम्झे । ती सारा बिग्रेका कामहरु जसलाई म सच्याउन चाहन्थे, मैले लिन चाहेर पनि लिन नसकेका सबै अनुभवहरु ।

source: As I thought about that later on, I came up with a saying, which is, "I collect bad wines."
ne: जब मैले यी सबैको बारेमा पछि सोचें, म यो निर्णयमा पुगे कि, "मैले गलत रक्सी जम्मा पारिरहेको छु ।"

source: Because if the wine is ready and the person is there, I'm opening it.
ne: किनकि जब रक्सी तयार छ र कोही त्यही छ – म रक्सी खोल्दै छु ।

source: I no longer want to postpone anything in life.
ne: अब म कुनै पनि कुरालाई थाँती राख्न चाहन्न ।

source: And that urgency, that purpose, has really changed my life.
ne: र त्यो आकस्मिकता, त्यो कारणले मेरो जीवनलाई साँच्चै नै परिवर्तन गरिदिएको छ ।

source: The second thing I learned that day -- and this is as we clear the George Washington Bridge, which was by not a lot -- (Laughter) I thought about, wow, I really feel one real regret.
ne: मैले त्यो दिन सिकेको दोस्रो कुरा –– र यो हामीले जर्ज वासिङ्टन पुललाई खाली गर्नु जस्तै हो, जुन त्यति ठुलो कुरा पनि होइन--- म प्रफुल्ल भए । मलाई साँच्चै नै एउटा पश्चाताप महसुस हुन्छ ।

source: I've lived a good life.
ne: मैले एउटा राम्रो जीन्दगी बाँचेको छु ।

source: In my own humanity and mistakes, I've tried to get better at everything I tried.
ne: मेरो आफ्नै मानवता तथा गल्तीहरूको सँगै मैले प्रयास गरेका हरेक चीजमा राम्रो हुन प्रयास गरेको छु ।

source: But in my humanity, I also allow my ego to get in.
ne: तर मेरो मानवतामा, म मेरो अहमलाई पनि स्वागत गर्छु ।

source: And I regretted the time I wasted on things that did not matter with people that matter.
ne: र मैले व्यर्थै खेर फालेको समय सोचेर पश्चाताप गरे जुन काम ती आवश्यक थिएन ती मानिससँग जुन महत्वपूर्ण थिए ।

source: And I thought about my relationship with my wife, with my friends, with people.
ne: र मैले सम्बन्धहरूको बारेमा सोचें मेरी पत्निसँगको, मेरा साथीसँगको, मानिसहरूसँगको ।

source: And after, as I reflected on that, I decided to eliminate negative energy from my life.
ne: र त्यसपछि, जब मैले त्यस विषयलाई लिएर आफैलाई ऐनामा हेरे, मैले मेरो जीवनबाट नकरात्मक उर्जालाई उत्सर्जन गर्ने निर्णय गरे ।

source: It's not perfect, but it's a lot better.
ne: यो सबै हिसाबबाट उपयुक्त त छैन, तर धेरै राम्रो चाही छ ।

source: I've not had a fight with my wife in two years.
ne: मैले यो २ वर्षमा आफ्नी पत्निसँगै कहिल्यै झगडा गरेको छैन । बडो आनन्दको महसुस हुन्छ ।

source: It feels great.
ne: म अबदेखि सही हुन चाहन्न,

source: I no longer try to be right; I choose to be happy.
ne: बस! खुसी रहन चाहन्छु ।

source: The third thing I learned -- and this is as your mental clock starts going, "15, 14, 13."
ne: मैले सिकेको तेस्रो कुरा– – यो तपाईंको दिमागी घडी जस्तै हो चलिरहन्छ, “१५”, “१४”, “१३”

source: You can see the water coming.
ne: तपाई पानी आइरहेको देख्नु हुन्छ ।

source: I'm saying, "Please blow up."
ne: म भन्छु, “कृपया मलाई बगाएर लैजाउ” ।

source: I don't want this thing to break in 20 pieces like you've seen in those documentaries.
ne: म यसलाई २० टुक्रामा विभाजन गर्न चाहन्न तपाईहरूले त्यो वृत्तचित्रमा देखे जस्तो ।

source: And as we're coming down, I had a sense of, wow, dying is not scary.
ne: जब हामी तल आउँदैछौं, मलाई रमाइलो अनुभव भयो । मर्नु डरलाग्दो छैन ।

source: It's almost like we've been preparing for it our whole lives.
ne: यो त हामीले जीन्दगी भरि गरिरहेको तयारी जस्तै छ ।

source: But it was very sad.
ne: तर यो धेरै दुःखदायी चाही थियो|

source: I didn't want to go; I love my life.
ne: म जान (मर्न) चाहन्न थिए, म मेरी पत्निलाई प्रेम गर्छु ।

source: And that sadness really framed in one thought, which is, I only wish for one thing.
ne: अनि त्यो दुःख एउटा सोचमा परिणत भयो जुन कुरा, मैले एउटै मात्रै चाहना गरे|

source: I only wish I could see my kids grow up.
ne: मैले चाहे की म मेरा छोराछोरीहरू बढेको देखुँ ।

source: About a month later, I was at a performance by my daughter -- first-grader, not much artistic talent -- (Laughter) Yet!
ne: त्यसको लगभग एक महिना पछि, म मेरी छोरीको (कला) प्रस्तुतिमा थिए । एक कक्षाकी छात्रा, त्यस्तो धेरै प्रतिभावान कलाकार त होइन ... ... तरपनि । (हाँसो)

source: (Laughter) And I'm bawling, I'm crying, like a little kid.
ne: म कराउदैछु, रूदैछु, सानो बच्चा जस्तै

source: And it made all the sense in the world to me.
ne: र यी सबै कुरा गर्नु मलाई निकै सान्दर्भिक नै लाग्दै थियो

source: I realized at that point, by connecting those two dots, that the only thing that matters in my life is being a great dad.
ne: त्यस क्षण मैले यो कुरा महसुस गरे कि ति दुई वटा आयामहरू लाइ जोडेर एउटै कुरा जुन मेरो जीवनमा महत्वपूर्ण छ-- त्यो भनेको एउटा राम्रो पिता हुनु हो । त्यो भन्दा पनि महत्वपूर्ण कुरा, महत्वपूर्ण कुरा,

source: Above all, above all, the only goal I have in life is to be a good dad.
ne: मेरो जीवनको एउटै मात्र उद्देश्य भनेको एउटा राम्रो पिता बन्नु हो ।

source: I was given the gift of a miracle, of not dying that day.
ne: मलाई एउटा चामत्कारिक उपहार प्राप्त भएको छ त्यो दिन नमर्नु

source: I was given another gift, which was to be able to see into the future and come back and live differently.
ne: मलाई अर्को पनि उपहार प्राप्त भएको छ, जुन चाही भविष्य देख्न सक्ने हुनु हो अनि त्यहाँबाट फर्केर आउने तथा फरक जीवन जिउने हुन सक्नु हो ।

source: I challenge you guys that are flying today, imagine the same thing happens on your plane -- and please don't -- but imagine, and how would you change?
ne: म तपाई आज उडिरहनु भएका साथीहरूलाई चुनौति दिन्छु, सम्झनुहोस कि तपाईहरूको जहाजमा पनि त्यहि कुरा भयो । तर कृपया नसम्झनुस् अनुमान गर्नुहोस, तपाईमा कस्तो परिवर्तन आउने थियो ?

source: What would you get done that you're waiting to get done because you think you'll be here forever?
ne: तपाईले के काम सम्पन्न गर्नुहुन्थ्यो, जुन तपाईंले थाती राख्नु भएको थियो किनकि तपाईंलाई लाग्छ तपाईं सधै यही रहिरहनु हुनेछ ?

source: How would you change your relationships and the negative energy in them?
ne: तपाईं कसरी सुधार गर्नुहुन्थ्यो आफ्नो सम्बन्धहरूलाई तथा सम्बन्धमा भएका खराब तत्वहरूलाई ?

source: And more than anything, are you being the best parent you can?
ne: र सबै भन्दा ठूलो कुरा, तपाईं सकेसम्म उत्तम अभिभावक बनिरहनुभएको छ ?

source: So for the past year and a half, my team at Push Pop Press and Charlie Melcher and Melcher Media have been working on creating the first feature-length interactive book.
ne: विगत डेढ बर्ष देखि, पुस पप प्रेस मा मेरो टोली र चार्ली मल्चर तथा मल्चर मिडिया पहिलो पूर्ण लम्वाईको पारस्परिक क्रियात्मक पुस्तक सिर्जनामा काम गरिरहेका छौं|

source: It's called "Our Choice" and the author is Al Gore.
ne: "आवर च्वाइस" भन्ने पुस्तक हो र अल गोर यसका लेखेक हुन |

source: It's the sequel to "An Inconvenient Truth," and it explores all the solutions that will solve the climate crisis.
ne: यो "एन इन्कन्भेनियन्ट ट्रुथ" को शिलशिला हो र यसले वातावरणीय विपतलाई हल गर्ने उपायहरूको खोजी गर्छ|

source: The book starts like this. This is the cover.
ne: किताब यसरी खुल्छ| यो कभर हो|

source: As the globe spins, we can see our location, and we can open the book and swipe through the chapters to browse the book.
ne: पृथ्वी घुम्दै गर्दा, हामी हाम्रो स्थान देख्न सक्छौं| त्यसपछि हामी किताब खोल्न सक्छौं र पढ्नको लागि पाठहरु पल्टाउन सक्छौं |

source: Or, we can scroll through the pages at the bottom.
ne: अथवा, किताबको पानालाई यसरी तलबाट पनि सार्न सकिन्छ|

source: And if we wanted to zoom into a page, we can just open it up.
ne: र यदि हामीले कुनै पेजलाई ठूलो पार्न चाह्यौं भने, यसरी खोलिहाल्न सकिन्छ|

source: And anything you see in the book, you can pick up with two fingers and lift off the page and open up.
ne: अनि किताबमा देखिने कुनै पनि कुरा, तपाईं दुई औंलाको सहायताले यसरी पानाबाट उठाएर खोल्न सक्नु हुन्छ|

source: And if you want to go back and read the book again, you just fold it back up and put it back on the page.
ne: र यदि तपाईं पुन: किताब पढ्न चाहनु हुन्छ भने, यसलाई पट्याएर पहिलेकै पानामा राख्नुस|

source: And so this works the same way; you pick it up and pop it open.
ne: अनि यसले पनि त्यसरी नै काम गर्छ; यसरी उठाउनुस र खोल्नुस|

source: (Audio) Al Gore: I consider myself among the majority who look at windmills and feel they're a beautiful addition to the landscape.
ne: (अडियो) अल गोर: म आफुलाई त्यस्ता बहुसंख्यक मान्छेहरुको बीचमा पाउँछु जसले वायुघट्टहरू हेरेर ठान्छन कि तिनीहरू हाम्रो प्रकृतिका गहना हुन्|

source: Mike Matas: And so throughout the whole book, Al Gore will walk you through and explain the photos.
ne: माइक माटास: अनि यो पुरै पुस्तक भरि अल गोरले फोटोहरुको बारेमा बताउदै अघि बढाउने छन् |

source: This photo, you can you can even see on an interactive map.
ne: यो फोटोलाई तपाईंलेपारस्परिक क्रियात्मक नक्शामा पनि हेर्न सक्नु हुन्छ |

source: Zoom into it and see where it was taken.
ne: यसलाई ठूलो पार्नुस र हेर्नुस् कहाँ खिचेको फोटो थियो यो|

source: And throughout the book, there's over an hour of documentary footage and interactive animations.
ne: अनि यो किताब भरिमा एक घण्टा भन्दा बढिको वृतचित्र का टुक्राहरु र पारस्परिक क्रियात्मक एनिमेशन छ|

source: So you can open this one.
ne: तपाईं यसलाई खोल्न सक्नु हुन्छ|

source: (Audio) AG: Most modern wind turbines consist of a large ...
ne: (अडियो) अल गोर: धेरैजसो आधुनिक हावाले चल्ने घट्टहरूले ठूलो ...

source: MM: It starts playing immediately.
ne: माइक: यो तुरुन्त बज्न सुरु गर्छ|

source: And while it's playing, we can pinch and peak back at the page, and the movie keeps playing.
ne: अनि यो बज्दै गर्दा, यसलाई उठाएर यहाँ पेजको माथि यसरी राख्न सकिन्छ, र यो चाहिं यसरी नै चलिरहन्छ|

source: Or we can zoom out to the table of contents, and the video keeps playing.
ne: अथवा यस्लाई हामी सानो पारेर यहाँ तल विषय सुचीमा पनि राख्न सकिन्छ, फेरि पनि भिडियो चली नै रहन्छ|

source: But one of the coolest things in this book are the interactive infographics.
ne: तर यो किताबका सबैभन्दा राम्रा पक्षहरुमा पारस्परिक क्रियात्मक तथ्यांक-चित्र पर्छन|

source: This one shows the wind potential all around the United States.
ne: यसले अमेरिका भरि वायु उर्जा क्षमता कति छ भन्ने देखाउछ|

source: But instead of just showing us the information, we can take our finger and explore, and see, state by state, exactly how much wind potential there is.
ne: तर मात्र जानकारी दिनुको अतिरिक्त हामीले औंलाको सहायताले अरु कुरा खोज्न सक्छौं, र हरेक राज्यमा ठ्याक्कै वायु उर्जाको क्षमता कति छ हेर्न सक्छौं|

source: We can do the same for geothermal energy and solar power.
ne: हामी जियोथर्मल उर्जा र सौर्य उर्जाको बारेमा थाहा पाउन पनि त्यस्तै गर्न सक्छौं|

source: This is one of my favorites.
ne: यो मेरो एकदम मन पर्ने कुरा हो|

source: So this shows ...
ne: यसले देखाउछ...

source: (Laughter) (Applause) When the wind is blowing, any excess energy coming from the windmill is diverted into the battery.
ne: (हाँसो) (ताली) जब हावा चल्छ, वायु घट्ट बाट भएर आएको थप उर्जा ब्याट्रीमा जान्छ|

source: And as the wind starts dying down, any excess energy will be diverted back into the house -- the lights never go out.
ne: अनि जब हावा सुस्त हुदै जान्छ, उक्त थप उर्जा घरभित्र जान्छ-- बत्तीहरू कहिल्यै निभ्दैनन|

source: And this whole book, it doesn't just run on the iPad.
ne: अनि यो पुरा किताब, आइप्याडमा मात्र होइन,

source: It also runs on the iPhone.
ne: आइफोनमा पनि चल्छ|

source: And so you can start reading on your iPad in your living room and then pick up where you left off on the iPhone.
ne: यसरी तपाईं बैठक कोठामा बसेर आइप्याडमा पढ्न सुरु गर्न सक्नु हुन्छ अनि आइफोनमा पढेर जहाँ छोड्नु भएको थियो त्यहीबाट अघि बढ्न सक्नु हुन्छ|

source: And it works the exact same way.
ne: र दुवैमा ठ्याक्कै त्यसरी नै काम गर्छ|

source: You can pinch into any page.
ne: औलाले कुनै पेजलाई समाउन सक्नु हुन्छ|

source: Open it up.
ne: यसलाई खोल्नुस|

source: So that's Push Pop Press' first title, Al Gore's "Our Choice."
ne: र यो पुस पप प्रेसको पहिलो शिर्षक, अल गोरको "आवर च्वाइस" हो|

source: (Applause) Chris Anderson: That's spectacular.
ne: (ताली) क्रिस एन्डरसन: त्यो हेर्नलायक छ|

source: Do you want to be a publisher, a technology licenser?
ne: तपाईं आफै प्रकाशक बन्न चाहनुहुन्छ या अरुलाई यसको अनुमति दिनुहुन्छ?

source: What is the business here?
ne: यसको व्यावसायिकता के हो?

source: Is this something that other people can do?
ne: के यसमा अरुहरुले गर्न सक्ने केही छ?

source: MM: Yeah, we're building a tool that makes it really easy for publishers right now to build this content.
ne: माइक: हो, हामीहरुले उपकरणहरू निर्माण गरिरहेका छौँ जसले प्रकाशकहरूलाई तत्कालै यी सब सामग्री तयार गर्न सजिलो बनाउछ|

source: So Melcher Media's team, who's on the East coast -- and we're on the West coast, building the software -- takes our tool and, every day, drags in images and text.
ne: त्यसैले मल्चर मिडियाको टोलीले, जो अमेरिकाको पुर्वी भागमा छ -- हामी पश्चिमी भागमा छौं, सफ्टवेयर बनाउँदै-- हाम्रो सामग्री लैजान्छ र, हरेक दिन, चित्र र शब्दमा समावेश गर्छ|

source: CA: So you want to license this software to publishers to make books as beautiful as that? (MM: Yes.) All right. Mike, thanks so much.
ne: एन्डरसन: त्यसोभए तपाईं यो सफ्टवेयरको लाइसेन्स प्रकाशकहरुलाई यस्तै राम्रा किताबहरू बनाउन दिनुहुन्छ? (माइक: हो|) ल त माइक, धेरै धेरै धन्यवाद|

source: MM: Thank you. (CA: Good luck.) (Applause)
ne: माइक: धन्यवाद | ( एन्डरसन: शुभ होस्) (ताली)

source: I'm used to thinking of the TED audience as a wonderful collection of some of the most effective, intelligent, intellectual, savvy, worldly and innovative people in the world.
ne: म TED का सहभागीहरूलाई यसरि सोच्ने गर्दछु TED एउटा जमात, जहाँ संसारका सबैभन्दा प्रभावशाली, बाठा, बौद्धिक र चतुर, भौतिकबादी र आविष्कारकहरूको समूह हो ।

source: And I think that's true.
ne: र मलाई लाग्छ यो सत्य हो|

source: However, I also have reason to believe that many, if not most, of you are actually tying your shoes incorrectly.
ne: तर, मसंग यो कुरामा विश्वास गर्ने तर्कहरू छन् कि, तपाईहरू लगभग आधा, अथवा धेरैले, बास्तबमै जुत्ताको तुना बेढंगसँग बाँध्नुभएको छ

source: (Laughter) Now I know that seems ludicrous.
ne: (हाँसो) यो अलिक हास्यास्पद लाग्न सक्छ

source: I know that seems ludicrous.
ne: हो मलाई थाहा छ।

source: And believe me, I lived the same sad life until about three years ago.
ne: बिश्वास गर्नुस, मैले पनि ३ बर्ष अघि सम्म त्यस्तै बैरागी जीवन बाँचेको थिएँ।

source: And what happened to me was I bought, what was for me, a very expensive pair of shoes.
ne: र भएको के थियो भने, मैले, आफ्नो लागि, एकजोर निकै महँगो जुत्ता किनेको थिएँ।

source: But those shoes came with round nylon laces, and I couldn't keep them tied.
ne: र त्यो जुत्तामा नाइलनको डोलो खालको तुना थियो, र मैले त्यो तुना बाध्नै सकिन।

source: So I went back to the store and said to the owner, "I love the shoes, but I hate the laces."
ne: अनि जुत्ताको पसलमा गएर पसलेलाई भने, "मलाई जुत्ता त मन पर्यो, तर तुना मन परेन।"

source: He took a look and said, "Oh, you're tying them wrong."
ne: उसले जुत्ता हेरेर भन्यो "तपैले तुना गलत बाँध्नु भएको छ"

source: Now up until that moment, I would have thought that, by age 50, one of the life skills that I had really nailed was tying my shoes.
ne: हो त्यतिबेला सम्म, मैले यो सोच्ने गर्थे कि, ५० वर्षको उमेरमा, मैले गतिलो संग जानेको काम मध्ये तुना बाँध्ने काम पनि एक हो।

source: (Laughter) But not so -- let me demonstrate.
ne: (हाँसो) तर त्यस्तो होइन- ल म देखाऊछु।

source: This is the way that most of us were taught to tie our shoes.
ne: यो तरिकाले हो हामी धेरै जसोलाई जुत्ताको तुना बाध्न सिकाइएको।

source: Now as it turns out -- thank you.
ne: र कुरो चाहिँ के हो भने- धन्यबाद।

source: (Applause) Wait, there's more.
ne: (प्रशंसा) पर्खनुस, अझै छ नि।

source: As it turns out -- (Laughter) there's a strong form and a weak form of this knot, and we were taught the weak form.
ne: कुरो चाहिँ के हो भने (हाँसो) बलियो र कम्जोर दुइ खालका तुनाका गाँठो हुन्छन, र हामीलाई कम्जोर खालको सिकाइएको छ

source: And here's how to tell.
ne: र कम्जोरभन्न्न यसरी सकिन्छ

source: If you pull the strands at the base of the knot, you will see that the bow will orient itself down the long axis of the shoe.
ne: यदि गाँठोको मुन्तिर बाट यसरि तान्नु भो भने तुनाको फुर्को जुत्ताको लामो पाटो (तलमाथि) तिर फर्किन्छ।

source: That's the weak form of the knot.
ne: र त्यो चाहिँ कम्जोर खालको गाँठो भयो।

source: But not to worry.
ne: तर केही समस्या छैन

source: If we start over and simply go the other direction around the bow, we get this, the strong form of the knot.
ne: यदि हाम्ले फेरी शुरु गर्यौ र मात्र अर्को दिशा तिर गयौ भने हामीले यो बलियो खालको गाँठो पाउनेछौ।

source: And if you pull the cords under the knot, you will see that the bow orients itself along the transverse axis of the shoe.
ne: र यदि गाँठोको मुन्तिर बाट यसरि तान्नु भो भने तपाईंले तुनाको फुर्को छोटो पाटो (दाँयाबाया) तिर फर्किन्छ।

source: This is a stronger knot.
ne: यो चाहिँ बलियो गाँठो हो।

source: It will come untied less often.
ne: यो कमै मात्र फुस्किने गर्छ।

source: It will let you down less, and not only that, it looks better.
ne: यस्ले तपाइँलाई कम निहुरिने गराउछ। साथसाथै यो राम्रो पनि देखिन्छ।

source: We're going to do this one more time.
ne: हामी एकपटक फेरी यो गाँठो पारौ।

source: (Applause) Start as usual -- (Applause) go the other way around the loop.
ne: (ताली) सधैजस्तो सुरुवात गर्नुस--- (ताली) अनि फुर्कोको अर्को तिरबाट जानुस।

source: This is a little hard for children, but I think you can handle it.
ne: यो केटाकेटी लाई अलीक कठिन हुन्छ। तर लाग्छ तपैलाइ चै ठिकै हुन्छ।

source: Pull the knot.
ne: गाँठो लाइ तान्नुस।

source: There it is: the strong form of the shoe knot.
ne: देख्नु भो त। तुनाको बलियो गाँठो।

source: Now, in keeping with today's theme, I'd like to point out -- something you already know -- that sometimes a small advantage someplace in life can yield tremendous results someplace else.
ne: अब, आजको प्रशङ्ग संग जोड्दै, म यो भन्न चाहन्छु-- जुन तपाईंलाई थाहै छ-- जिन्दगीमा कतै गरिएका सानै उपलब्धिले पनि जीवनको कुनै मोडमा धेरै नै फाइदा दिन सक्छ।

source: (Laughter) Live long and prosper.
ne: (हाँसो) हाँसीखुसी जिउनुस्।

source: A few years ago, I felt like I was stuck in a rut, so I decided to follow in the footsteps of the great American philosopher, Morgan Spurlock, and try something new for 30 days.
ne: केही वर्ष पहिले, मलाई मेरो जीवन निरसिलो लाग्दैथ्यो त्यसैले मैले अमेरिकन दर्शनशास्त्री मोर्गन स्पर्लकले सुझाएको बाटो हिड्ने प्रयास गरे, ३० दिनसम्म केही नौलो कुरा निरन्तर गरिरहने

source: The idea is actually pretty simple.
ne: बास्तबमै यो निकै सहज कुरा पनि हो।

source: Think about something you've always wanted to add to your life and try it for the next 30 days.
ne: तपाईंले सधै नै गर्न चाहेको कुरालाई लिनुस् र त्यसलाई ३० दिनसम्म निरन्तरता दिनुस्।

source: It turns out 30 days is just about the right amount of time to add a new habit or subtract a habit -- like watching the news -- from your life.
ne: यस्तो लाग्छ कि ३० दिन बिल्कुल सही समय हो, तपाईले गर्न चाहेको र छोड्न चाहेको कुराको लागि -जस्तो कि समाचार हेर्ने बानी--

source: There's a few things I learned while doing these 30-day challenges.
ne: यो ३० दिने काम गर्दा मैले केही कुराहरु सिके

source: The first was, instead of the months flying by, forgotten, the time was much more memorable.
ne: पहिलो, जस्तो कि पहिले जस्तो महिनादिन बिनाअर्थ उडेर गए जस्तो भएन गरिएका कामहरू सम्झनायोग्य भए।

source: This was part of a challenge I did to take a picture every day for a month.
ne: प्रत्येक दिन तस्बीर खिच्ने काम मैले गरेको ३० दिने काममा एक थियो

source: And I remember exactly where I was and what I was doing that day.
ne: र मैले ठ्याक्कै सम्झन्छुकि म कुन दिन कहाँ के गर्दै थिए भन्ने कुरा

source: I also noticed that as I started to do more and harder 30-day challenges, my self-confidence grew.
ne: र जब मैले अझै कठिन खालका ३० दिने काम गर्न थाले, मेरो आत्मविश्वासमा वृद्धि भएको आभास पाए।

source: I went from desk-dwelling computer nerd to the kind of guy who bikes to work.
ne: म कम्प्युटरमा झुण्डीरहने व्यक्तिबाट काममा जादा पनि साइकलमा जाने भए।

source: For fun!
ne: रमाइलोको लागि।

source: (Laughter) Even last year, I ended up hiking up Mt. Kilimanjaro, the highest mountain in Africa.
ne: (हाँसो) गत बर्ष त झन्, म अफ्रीकाको सर्वोच्च शिखर किलिमन्जारो पर्वत चढे ।

source: I would never have been that adventurous before I started my 30-day challenges.
ne: यस्तो ३० दिने काम नगरेको भए म त्यस्तो साहसिक कार्य गर्ने व्यक्ति हुने थिइन

source: I also figured out that if you really want something badly enough, you can do anything for 30 days.
ne: मैले यो पनि जाने कि तपाईं यदि केही कुरा आत्मैदेखि चाहनुहुन्छ भने, तपाईं साच्चि नै ३० दिनमा सक्नु हुन्छ

source: Have you ever wanted to write a novel?
ne: के तपाईंलाई उपन्यास लेख्ने चाहना थियो?

source: Every November, tens of thousands of people try to write their own 50,000-word novel, from scratch, in 30 days.
ne: प्रत्येक नोभेम्बरमा, हज्जारौ मान्छेहरू ३० दिनमा ५०००० शब्दको आफ्नै उपन्यास लेख्ने कोशिश गर्छन, त्यो पनि शून्यबाट,

source: It turns out, all you have to do is write 1,667 words a day for a month.
ne: चुरो कुरो के हो भने, तपाइले दिनको १६६७ शब्द लेख्नुपर्ने हुन्छ, १ महीनासम्म,

source: So I did.
ne: मैले पनि त्यही नै गरे

source: By the way, the secret is not to go to sleep until you've written your words for the day.
ne: र भित्री कुरो के हो भने, तपाईंले त्यति शब्द नलेख्दासम्म सुत्न चाहिँ जानहुन्न।

source: You might be sleep-deprived, but you'll finish your novel.
ne: बरु अनिदो बस्नुहोला, तर तपाईंले उपन्यास लेखि सक्नुहुन्छ।

source: Now is my book the next great American novel?
ne: के मेरो उपन्यास अर्को खत्रा अमेरिकन उपन्यास हो त?

source: No. I wrote it in a month.
ne: हैट, होइन, १ मैनामा लेख्या न हो।

source: It's awful.
ne: यो साच्चिकै नराम्रो छ।

source: (Laughter) But for the rest of my life, if I meet John Hodgman at a TED party, I don't have to say, "I'm a computer scientist."
ne: (हाँसो) तर मेरो बाकी जिन्दगीभर, मैले जोन हजम्यानलाई TED को भोजमा भेटे भने मैले 'म कम्प्युटर विज्ञ हो' भनेर चिनाई राख्नुपर्ने छैन।

source: No, no, if I want to, I can say, "I'm a novelist."
ne: साच्ची भनेको, मैले चाहेको बखत "म उपन्यासकार हु" भन्न सक्ने भए।

source: (Laughter) So here's one last thing I'd like to mention.
ne: (हाँसो) र अन्त्यमा म यो भन्न चाहन्छु कि

source: I learned that when I made small, sustainable changes, things I could keep doing, they were more likely to stick.
ne: जब मैले साना र आत्मनिर्भर हुने परिवर्तनका काम गरे जुन मैले गरि राख्न सक्थे तिनीहरू हासिल गर्न सकिन्छ भन्ने बुझे।
